[
  {
    "id": 1,
    "tipo": 1,
    "dificuldade": "média",
    "enunciado": "Em um sistema de monitoramento térmico, é necessário medir temperatura sem precisar de calibração prévia, com resposta rápida e sem depender de variação resistiva. Qual sensor atende melhor a essas condições?",
    "imagem": "",
    "alternativas": [
      "Termistor PTC, que aumenta a resistência com a temperatura e requer calibração frequente.",
      "RTD, precisa e estável, mas exige calibração e corrente de excitação.",
      "Cristal piezoelétrico, adequado para medir pressão e vibração, não temperatura.",
      "Termistor NTC, que tem resposta não linear e exige compensação eletrônica."
    ],
    "correta": "Termopar, formado por dois metais diferentes, que gera uma tensão proporcional à diferença de temperatura entre as junções.",
    "obs": [
      "O termopar dispensa calibração direta e responde rapidamente a variações térmicas.",
      "Usa princípio termoelétrico (efeito Seebeck) e não depende de resistência elétrica."
    ]
  },
  {
    "id": 2,
    "tipo": 2,
    "dificuldade": "média",
    "enunciado": "A pressão hidrostática aumenta linearmente com a profundidade, segundo P = ρ·g·z. Considere ρ = 1,025×10³ kg/m³ e g = 9,8 m/s². Qual gráfico representa corretamente essa relação entre profundidade e pressão?",
    "imagem": "",
    "alternativas": [
      "assets/pressao_hidrostática2.png",
      "assets/pressao_hidrostática3.png",
      "assets/pressao_hidrostática4.png",
      "Nenhuma das anteriores."
    ],
    "correta": "assets/pressao_hidrostática1.png",
    "obs": [
      "A relação P = ρ·g·z é linear: quanto maior a profundidade, maior a pressão.",
      "O gráfico correto é uma reta partindo da origem (z = 0, P = 0)."
    ]
  },
  {
    "id": 3,
    "tipo": 3,
    "dificuldade": "média",
    "enunciado": "Um sensor RTD de platina tem resistência nominal <R0> Ω a 0 °C. Sabendo que a resistência medida é <RM> Ω e o coeficiente de temperatura é <ALPHA> 1/°C, calcule a temperatura do sensor pela equação:\n\nRF = RI × (1 + α × ΔT)\n\nQual é o valor de ΔT (temperatura atual)?",
    "imagem": "",
    "variaveis": {
      "R0": { "min": 90, "max": 110, "step": 1 },
      "ALPHA": { "min": 0.0037, "max": 0.0041, "step": 0.0001 },
      "RM": { "min": 0, "max": 200, "step": 1 }
    },
    "resolucoes": {
      "TEMP": "(RM - R0) / (R0 * ALPHA)"
    },
    "alternativas": [
      "O valor correto é <TEMP + 1>",
      "O valor correto é <TEMP / 1.5>",
      "O valor correto é <TEMP - 2.5>",
      "O valor correto é <TEMP * 0.5>"
    ],
    "correta": "O valor correto é <TEMP>",
    "obs": [
      "A fórmula básica de RTDs é linear para pequenas variações de temperatura.",
      "A resistência cresce proporcionalmente à temperatura do sensor."
    ]
  },
  {
    "id": 4,
    "tipo": 4,
    "dificuldade": "média",
    "enunciado": "Durante o estudo de um sistema de ventilação, o engenheiro precisa compreender os tipos de pressão presentes no escoamento do ar. Analise as afirmações e assinale a alternativa correta.",
    "imagem": "",
    "afirmacoes": {
      "I": "A pressão dinâmica é gerada por um fluido em movimento e medida com tomada voltada contra o fluxo.",
      "II": "A pressão estática é a força exercida pelo fluido em repouso, medida perpendicularmente ao escoamento.",
      "III": "A pressão diferencial é a variação de pressão entre dois pontos de um sistema.",
      "IV": "A pressão estática é medida na linha de impacto do fluido, o que aumenta sua precisão.",
      "V": "A pressão dinâmica é usada para medir vazão com tubos de Pitot.",
      "VI": "A pressão diferencial só se aplica a gases comprimidos."
    },
    "alternativas": [
      "Apenas I, II e III estão corretas.",
      "Apenas II, III e IV estão corretas.",
      "Apenas I, IV e VI estão corretas.",
      "Apenas II, V e VI estão corretas."
    ],
    "correta": "Apenas I, II, III e V estão corretas.",
    "obs": [
      "Pressão estática → força em repouso; dinâmica → movimento; diferencial → diferença entre pontos.",
      "O tubo de Pitot combina medições estática e dinâmica para calcular a vazão.",
      "A afirmativa IV é falsa porque a linha de impacto mede pressão total, não estática.",
      "A VI é incorreta: pressão diferencial se aplica a qualquer fluido, compressível ou não."
    ]
  }
]